In [1]:
# Importing Libraries
import sqlite3
import pandas as pd

In [2]:
# Connecting with SQLite database
sqlite_con = sqlite3.connect("db_sqlite.db")

In [5]:
# Create table
create_table_query = """
CREATE TABLE IF NOT EXISTS table_1 (
    id INTEGER PRIMARY KEY,
    name TEXT,
    age INTEGER
);
"""

sqlite_con.execute(create_table_query)

In [4]:
# Drop table - if exists
drop_table_query = '''
DROP TABLE IF EXISTS tabela;
'''
sqlite_con.execute(drop_table_query)

In [6]:
# Insert data in the table
data = [
    (1, "João", 25),
    (2, "Maria", 30),
    (3, "José", 28),
    (4, None, None)
]

insert_query = "INSERT INTO table_1 (id, name, age) VALUES (?, ?, ?)"
sqlite_con.executemany(insert_query, data)

In [7]:
# Saving Alterations
sqlite_con.commit()

In [8]:
# Consulting with pandas
select_query = "SELECT * FROM table_1"

df = pd.read_sql(select_query, sqlite_con)

# Show Dataframe
df

   id   name   age
0   1   João  25.0
1   2  Maria  30.0
2   3   José  28.0
3   4   None   NaN